Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# Set_save_shiftInPlace
source: Save in place even when the length changes
ar: الحفظ في المكان حتى عند تغيّر الطول
cs: Ukládat na místě i při změně délky
de: Auch bei Längenänderung direkt speichern
el: Αποθήκευση επί τόπου ακόμη και όταν αλλάζει το μήκος
es: Guardar en el mismo lugar aunque cambie la longitud
fa: ذخیره در محل حتی وقتی طول تغییر می‌کند
fr: Enregistrer sur place même si la longueur change
hu: Mentés helyben akkor is, ha a hossz megváltozik
id: Simpan di tempat meskipun panjang berubah
it: Salva sul posto anche se la lunghezza cambia
ja: 長さが変わる場合もその場で書く
ko: 길이가 바뀌어도 제자리에 저장
pl: Zapisuj w miejscu nawet przy zmianie długości
pt: Salvar no local mesmo quando o comprimento muda
ro: Salvare pe loc chiar și când se modifică lungimea
th: บันทึกในที่เดิมแม้ความยาวจะเปลี่ยน
tr: Uzunluk değişse bile yerinde kaydet
uk: Зберігати на місці, навіть якщо змінюється довжина
vi: Lưu tại chỗ ngay cả khi độ dài thay đổi
zh_hans: 即使长度改变也原地保存
zh_hant: 長度變更時也就地儲存

# SetDesc_save_shiftInPlace
source: Shifts data inside the original file instead of writing a temporary file. Needs little free space, but if saving is interrupted the file is damaged. You're asked every time.
ar: يزيح البيانات داخل الملف الأصلي بدلاً من كتابة ملف مؤقت. يحتاج إلى مساحة خالية قليلة، لكن إذا انقطع الحفظ يتلف الملف. يُطلب منك التأكيد في كل مرة.
cs: Místo zápisu dočasného souboru posouvá data uvnitř původního souboru. Potřebuje málo volného místa, ale pokud se ukládání přeruší, soubor se poškodí. Pokaždé budete dotázáni.
de: Verschiebt Daten innerhalb der Originaldatei, statt eine temporäre Datei zu schreiben. Benötigt wenig freien Speicherplatz, aber bei einer Unterbrechung wird die Datei beschädigt. Sie werden jedes Mal gefragt.
el: Μετατοπίζει τα δεδομένα μέσα στο αρχικό αρχείο αντί να γράφει προσωρινό αρχείο. Χρειάζεται λίγο ελεύθερο χώρο, αλλά αν η αποθήκευση διακοπεί το αρχείο καταστρέφεται. Σας ζητείται επιβεβαίωση κάθε φορά.
es: Desplaza los datos dentro del archivo original en lugar de escribir un archivo temporal. Necesita poco espacio libre, pero si se interrumpe el guardado el archivo queda dañado. Se pregunta cada vez.
fa: به‌جای نوشتن فایل موقت، داده را درون فایل اصلی جابه‌جا می‌کند. فضای آزاد کمی لازم دارد، اما اگر ذخیره قطع شود فایل آسیب می‌بیند. هر بار از شما پرسیده می‌شود.
fr: Décale les données à l'intérieur du fichier d'origine au lieu d'écrire un fichier temporaire. Nécessite peu d'espace libre, mais si l'enregistrement est interrompu, le fichier est endommagé. Une confirmation est demandée à chaque fois.
hu: Ideiglenes fájl írása helyett az eredeti fájlon belül tolja el az adatokat. Kevés szabad hely kell hozzá, de ha a mentés megszakad, a fájl megsérül. A program minden alkalommal rákérdez.
id: Menggeser data di dalam file asli alih-alih menulis file sementara. Hanya perlu sedikit ruang kosong, tetapi jika penyimpanan terputus, file akan rusak. Anda akan ditanya setiap kali.
it: Sposta i dati all'interno del file originale invece di scrivere un file temporaneo. Richiede poco spazio libero, ma se il salvataggio viene interrotto il file si danneggia. Viene chiesta conferma ogni volta.
ja: 一時ファイルを作らず、元のファイルの中でデータをずらしながら書きます。空き容量はほとんど要りませんが、途中で止まるとファイルが壊れます。実行のたびに確認します。
ko: 임시 파일을 쓰는 대신 원본 파일 안에서 데이터를 이동합니다. 여유 공간이 거의 필요 없지만 저장이 중단되면 파일이 손상됩니다. 매번 확인합니다.
pl: Przesuwa dane wewnątrz oryginalnego pliku zamiast zapisywać plik tymczasowy. Wymaga niewiele wolnego miejsca, ale przerwanie zapisu uszkadza plik. Pytanie jest wyświetlane za każdym razem.
pt: Desloca os dados dentro do arquivo original em vez de gravar um arquivo temporário. Precisa de pouco espaço livre, mas se o salvamento for interrompido o arquivo será danificado. A confirmação é solicitada todas as vezes.
ro: Deplasează datele în interiorul fișierului original în loc să scrie un fișier temporar. Necesită puțin spațiu liber, dar dacă salvarea este întreruptă, fișierul se deteriorează. Vi se solicită confirmarea de fiecare dată.
th: เลื่อนข้อมูลภายในไฟล์ต้นฉบับแทนการเขียนไฟล์ชั่วคราว ใช้พื้นที่ว่างน้อย แต่หากการบันทึกถูกขัดจังหวะ ไฟล์จะเสียหาย ระบบจะถามคุณทุกครั้ง
tr: Geçici dosya yazmak yerine verileri özgün dosyanın içinde kaydırır. Az boş alan gerekir, ancak kaydetme yarıda kalırsa dosya zarar görür. Her seferinde sorulur.
uk: Зсувати дані всередині вихідного файлу замість запису тимчасового файлу. Потрібно мало вільного місця, але якщо збереження перерветься, файл буде пошкоджено. Запит виводиться щоразу.
vi: Dịch dữ liệu bên trong tệp gốc thay vì ghi tệp tạm. Cần ít dung lượng trống, nhưng nếu việc lưu bị gián đoạn thì tệp sẽ bị hỏng. Bạn sẽ được hỏi mỗi lần.
zh_hans: 在原始文件内移动数据，而不是写入临时文件。几乎不需要可用空间，但如果保存中断，文件将损坏。每次都会询问。
zh_hant: 在原始檔案內移動資料，而不寫入暫存檔。所需的可用空間很少，但如果儲存中斷，檔案會損毀。每次都會詢問您。

# Find_Kind_RegexText.Content
source: Regular expression (text)
ar: تعبير عادي (نص)
cs: Regulární výraz (text)
de: Regulärer Ausdruck (Text)
el: Κανονική έκφραση (κείμενο)
es: Expresión regular (texto)
fa: عبارت باقاعده (متن)
fr: Expression régulière (texte)
hu: Reguláris kifejezés (szöveg)
id: Ekspresi reguler (teks)
it: Espressione regolare (testo)
ja: 正規表現 (テキスト)
ko: 정규식(텍스트)
pl: Wyrażenie regularne (tekst)
pt: Expressão regular (texto)
ro: Expresie regulată (text)
th: นิพจน์ทั่วไป (ข้อความ)
tr: Normal ifade (metin)
uk: Регулярний вираз (текст)
vi: Biểu thức chính quy (văn bản)
zh_hans: 正则表达式（文本）
zh_hant: 規則運算式（文字）

# Find_Kind_RegexBytes.Content
source: Regular expression (bytes)
ar: تعبير عادي (بايتات)
cs: Regulární výraz (bajty)
de: Regulärer Ausdruck (Bytes)
el: Κανονική έκφραση (byte)
es: Expresión regular (bytes)
fa: عبارت باقاعده (بایت)
fr: Expression régulière (octets)
hu: Reguláris kifejezés (bájtok)
id: Ekspresi reguler (byte)
it: Espressione regolare (byte)
ja: 正規表現 (バイト列)
ko: 정규식(바이트)
pl: Wyrażenie regularne (bajty)
pt: Expressão regular (bytes)
ro: Expresie regulată (octeți)
th: นิพจน์ทั่วไป (ไบต์)
tr: Normal ifade (baytlar)
uk: Регулярний вираз (байти)
vi: Biểu thức chính quy (byte)
zh_hans: 正则表达式（字节）
zh_hant: 規則運算式（位元組）

# Find_KindName_RegexText
source: Regex
ar: تعبير عادي
cs: Regulární výraz
el: Κανονική έκφραση
fa: عبارت باقاعده
ja: 正規表現
ko: 정규식
tr: Normal ifade
uk: Регулярний вираз
zh_hans: 正则表达式
zh_hant: 規則運算式

# Find_KindName_RegexBytes
source: Byte regex
ar: تعبير عادي للبايتات
cs: Bajtový regulární výraz
el: Κανονική έκφραση byte
es: Regex de bytes
fa: عبارت باقاعدهٔ بایتی
fr: Regex d'octets
hu: Bájt-regex
id: Regex byte
it: Regex byte
ja: バイト列の正規表現
ko: 바이트 정규식
pl: Regex bajtowe
pt: Regex de bytes
ro: Regex pe octeți
th: Regex ไบต์
tr: Bayt normal ifadesi
uk: Байтовий регулярний вираз
vi: Regex byte
zh_hans: 字节正则表达式
zh_hant: 位元組規則運算式

# Find_KindName_MultiTerm
source: Multiple terms
ar: عبارات متعددة
cs: Více výrazů
de: Mehrere Begriffe
el: Πολλαπλοί όροι
es: Varios términos
fa: چند عبارت
fr: Plusieurs termes
hu: Több kifejezés
id: Beberapa istilah
it: Più termini
ja: 複数語
ko: 여러 검색어
pl: Wiele terminów
pt: Vários termos
ro: Termeni multipli
th: หลายคำ
tr: Birden çok terim
uk: Кілька термінів
vi: Nhiều từ
zh_hans: 多个搜索词
zh_hant: 多個字詞

# Find_KindName_Mismatch
source: Not matching
ar: غير مطابق
cs: Neshodující se
de: Nicht übereinstimmend
el: Μη αντιστοιχία
es: No coincidente
fa: نامنطبق
fr: Non correspondant
hu: Nem egyező
id: Tidak cocok
it: Non corrispondente
ja: 一致しない箇所
ko: 불일치
pl: Niezgodne
pt: Sem correspondência
ro: Nepotrivire
th: ไม่ตรงกัน
tr: Eşleşmeyen
uk: Невідповідність
vi: Không khớp
zh_hans: 不匹配
zh_hant: 不符合

# Find_EncodingSetName.PlaceholderText
source: Name of this combination
ar: اسم هذه المجموعة
cs: Název této kombinace
de: Name dieser Kombination
el: Όνομα αυτού του συνδυασμού
es: Nombre de esta combinación
fa: نام این ترکیب
fr: Nom de cette combinaison
hu: A kombináció neve
id: Nama kombinasi ini
it: Nome di questa combinazione
ja: この組み合わせの名前
ko: 이 조합의 이름
pl: Nazwa tej kombinacji
pt: Nome desta combinação
ro: Numele acestei combinații
th: ชื่อของชุดนี้
tr: Bu birleşimin adı
uk: Назва цього поєднання
vi: Tên của tổ hợp này
zh_hans: 此组合的名称
zh_hant: 此組合的名稱

# Find_EncodingSetSave.Content
source: Save
ar: حفظ
cs: Uložit
de: Speichern
el: Αποθήκευση
es: Guardar
fa: ذخیره
fr: Enregistrer
hu: Mentés
id: Simpan
it: Salva
ja: 保存
ko: 저장
pl: Zapisz
pt: Salvar
ro: Salvare
th: บันทึก
tr: Kaydet
uk: Зберегти
vi: Lưu
zh_hans: 保存
zh_hant: 儲存

# Find_EncodingSet_Default
source: Default (ASCII, UTF-8, UTF-16LE, UTF-16BE)
ar: الافتراضي (ASCII، UTF-8، UTF-16LE، UTF-16BE)
cs: Výchozí (ASCII, UTF-8, UTF-16LE, UTF-16BE)
de: Standard (ASCII, UTF-8, UTF-16LE, UTF-16BE)
el: Προεπιλογή (ASCII, UTF-8, UTF-16LE, UTF-16BE)
es: Predeterminado (ASCII, UTF-8, UTF-16LE, UTF-16BE)
fa: پیش‌فرض (ASCII، UTF-8، UTF-16LE، UTF-16BE)
fr: Par défaut (ASCII, UTF-8, UTF-16LE, UTF-16BE)
hu: Alapértelmezett (ASCII, UTF-8, UTF-16LE, UTF-16BE)
it: Predefinita (ASCII, UTF-8, UTF-16LE, UTF-16BE)
ja: 既定 (ASCII、UTF-8、UTF-16LE、UTF-16BE)
ko: 기본값(ASCII, UTF-8, UTF-16LE, UTF-16BE)
pl: Domyślna (ASCII, UTF-8, UTF-16LE, UTF-16BE)
pt: Padrão (ASCII, UTF-8, UTF-16LE, UTF-16BE)
ro: Implicit (ASCII, UTF-8, UTF-16LE, UTF-16BE)
th: ค่าเริ่มต้น (ASCII, UTF-8, UTF-16LE, UTF-16BE)
tr: Varsayılan (ASCII, UTF-8, UTF-16LE, UTF-16BE)
uk: Стандартне (ASCII, UTF-8, UTF-16LE, UTF-16BE)
vi: Mặc định (ASCII, UTF-8, UTF-16LE, UTF-16BE)
zh_hans: 默认（ASCII、UTF-8、UTF-16LE、UTF-16BE）
zh_hant: 預設（ASCII、UTF-8、UTF-16LE、UTF-16BE）

# Find_EncodingSet_Name
source: Saved combinations
ar: المجموعات المحفوظة
cs: Uložené kombinace
de: Gespeicherte Kombinationen
el: Αποθηκευμένοι συνδυασμοί
es: Combinaciones guardadas
fa: ترکیب‌های ذخیره‌شده
fr: Combinaisons enregistrées
hu: Mentett kombinációk
id: Kombinasi tersimpan
it: Combinazioni salvate
ja: 保存した組み合わせ
ko: 저장된 조합
pl: Zapisane kombinacje
pt: Combinações salvas
ro: Combinații salvate
th: ชุดที่บันทึกไว้
tr: Kaydedilmiş birleşimler
uk: Збережені поєднання
vi: Tổ hợp đã lưu
zh_hans: 已保存的组合
zh_hant: 已儲存的組合

# Find_Encoding_Multi
source: Multiple encodings
ar: ترميزات متعددة
cs: Více kódování
de: Mehrere Codierungen
el: Πολλαπλές κωδικοποιήσεις
es: Varias codificaciones
fa: چند رمزگذاری
fr: Plusieurs encodages
hu: Több kódolás
id: Beberapa pengodean
it: Più codifiche
ja: 複数
ko: 여러 인코딩
pl: Wiele kodowań
pt: Várias codificações
ro: Codificări multiple
th: หลายการเข้ารหัส
tr: Birden çok kodlama
uk: Кілька кодувань
vi: Nhiều bảng mã
zh_hans: 多种编码
zh_hant: 多種編碼

# Find_EncodingsExcluded
source: Not searched (can't encode): {0}
ar: لم يتم البحث (يتعذر الترميز): {0}
cs: Neprohledáno (nelze zakódovat): {0}
de: Nicht durchsucht (Codierung nicht möglich): {0}
el: Δεν έγινε αναζήτηση (αδύνατη κωδικοποίηση): {0}
es: No se buscó (no se puede codificar): {0}
fa: جستجو نشد (رمزگذاری ممکن نیست): {0}
fr: Non recherchés (encodage impossible) : {0}
hu: Nem keresett (nem kódolható): {0}
id: Tidak dicari (tidak dapat dienkode): {0}
it: Non cercate (impossibile codificare): {0}
ja: 符号化できないため除外: {0}
ko: 검색 안 함(인코딩 불가): {0}
pl: Nie przeszukano (nie można zakodować): {0}
pt: Não pesquisadas (não é possível codificar): {0}
ro: Necăutate (nu se poate codifica): {0}
th: ไม่ได้ค้นหา (เข้ารหัสไม่ได้): {0}
tr: Aranmadı (kodlanamıyor): {0}
uk: Не шукали (неможливо закодувати): {0}
vi: Không tìm (không thể mã hóa): {0}
zh_hans: 未搜索（无法编码）：{0}
zh_hant: 未搜尋（無法編碼）：{0}

# Find_Error_PositionModulus
source: The period x must be from 1 to {0}.
ar: يجب أن تكون الدورة x من 1 إلى {0}.
cs: Perioda x musí být od 1 do {0}.
de: Die Periode x muss zwischen 1 und {0} liegen.
el: Η περίοδος x πρέπει να είναι από 1 έως {0}.
es: El período x debe estar entre 1 y {0}.
fa: دورهٔ x باید از 1 تا {0} باشد.
fr: La période x doit être comprise entre 1 et {0}.
hu: Az x periódusnak 1 és {0} között kell lennie.
id: Periode x harus dari 1 hingga {0}.
it: Il periodo x deve essere compreso tra 1 e {0}.
ja: 周期 x は 1〜{0} で指定してください。
ko: 주기 x는 1~{0}이어야 합니다.
pl: Okres x musi wynosić od 1 do {0}.
pt: O período x deve ser de 1 a {0}.
ro: Perioada x trebuie să fie între 1 și {0}.
th: รอบ x ต้องอยู่ระหว่าง 1 ถึง {0}
tr: x periyodu 1 ile {0} arasında olmalıdır.
uk: Період x має бути від 1 до {0}.
vi: Chu kỳ x phải từ 1 đến {0}.
zh_hans: 周期 x 必须为 1 到 {0}。
zh_hant: 週期 x 必須為 1 到 {0}。

# Find_Error_PositionRemainder
source: The remainder y must be from 0 to {0}.
ar: يجب أن يكون الباقي y من 0 إلى {0}.
cs: Zbytek y musí být od 0 do {0}.
de: Der Rest y muss zwischen 0 und {0} liegen.
el: Το υπόλοιπο y πρέπει να είναι από 0 έως {0}.
es: El resto y debe estar entre 0 y {0}.
fa: باقی‌ماندهٔ y باید از 0 تا {0} باشد.
fr: Le reste y doit être compris entre 0 et {0}.
hu: Az y maradéknak 0 és {0} között kell lennie.
id: Sisa y harus dari 0 hingga {0}.
it: Il resto y deve essere compreso tra 0 e {0}.
ja: 余り y は 0〜{0} で指定してください。
ko: 나머지 y는 0~{0}이어야 합니다.
pl: Reszta y musi wynosić od 0 do {0}.
pt: O resto y deve ser de 0 a {0}.
ro: Restul y trebuie să fie între 0 și {0}.
th: เศษ y ต้องอยู่ระหว่าง 0 ถึง {0}
tr: y kalanı 0 ile {0} arasında olmalıdır.
uk: Остача y має бути від 0 до {0}.
vi: Số dư y phải từ 0 đến {0}.
zh_hans: 余数 y 必须为 0 到 {0}。
zh_hant: 餘數 y 必須為 0 到 {0}。

# Find_Error_MaskLengthMismatch
source: The value ({0} bytes) and the mask ({1} bytes) have different lengths.
ar: القيمة ({0} بايت) والقناع ({1} بايت) بأطوال مختلفة.
cs: Hodnota ({0} B) a maska ({1} B) mají různé délky.
de: Der Wert ({0} Bytes) und die Maske ({1} Bytes) sind unterschiedlich lang.
el: Η τιμή ({0} byte) και η μάσκα ({1} byte) έχουν διαφορετικά μήκη.
es: El valor ({0} bytes) y la máscara ({1} bytes) tienen longitudes distintas.
fa: مقدار ({0} بایت) و ماسک ({1} بایت) طول‌های متفاوتی دارند.
fr: La valeur ({0} octets) et le masque ({1} octets) n'ont pas la même longueur.
hu: Az érték ({0} bájt) és a maszk ({1} bájt) hossza eltér.
id: Nilai ({0} byte) dan mask ({1} byte) memiliki panjang berbeda.
it: Il valore ({0} byte) e la maschera ({1} byte) hanno lunghezze diverse.
ja: 値 ({0} バイト) とマスク ({1} バイト) の長さが違います。
ko: 값({0}바이트)과 마스크({1}바이트)의 길이가 다릅니다.
pl: Wartość (bajty: {0}) i maska (bajty: {1}) mają różne długości.
pt: O valor ({0} bytes) e a máscara ({1} bytes) têm comprimentos diferentes.
ro: Valoarea ({0} octeți) și masca ({1} octeți) au lungimi diferite.
th: ค่า ({0} ไบต์) และมาสก์ ({1} ไบต์) มีความยาวต่างกัน
tr: Değer ({0} bayt) ile maske ({1} bayt) farklı uzunlukta.
uk: Значення ({0} байтів) і маска ({1} байтів) мають різну довжину.
vi: Giá trị ({0} byte) và mặt nạ ({1} byte) có độ dài khác nhau.
zh_hans: 值（{0} 字节）和掩码（{1} 字节）的长度不同。
zh_hant: 值（{0} 個位元組）與遮罩（{1} 個位元組）的長度不同。

# Find_Error_MaskTooLong
source: The mask can be at most {0} bytes.
ar: يمكن أن يكون القناع {0} بايت كحد أقصى.
cs: Maska může mít nejvýše {0} bajtů.
de: Die Maske darf höchstens {0} Bytes lang sein.
el: Η μάσκα μπορεί να είναι έως {0} byte.
es: La máscara puede tener como máximo {0} bytes.
fa: ماسک حداکثر {0} بایت می‌تواند باشد.
fr: Le masque ne peut pas dépasser {0} octets.
hu: A maszk legfeljebb {0} bájt lehet.
id: Mask paling banyak {0} byte.
it: La maschera può essere al massimo di {0} byte.
ja: マスクは {0} バイトまでです。
ko: 마스크는 최대 {0}바이트까지 가능합니다.
pl: Maska może mieć najwyżej {0} B.
pt: A máscara pode ter no máximo {0} bytes.
ro: Masca poate avea cel mult {0} octeți.
th: มาสก์ยาวได้สูงสุด {0} ไบต์
tr: Maske en fazla {0} bayt olabilir.
uk: Маска може містити не більше {0} байтів.
vi: Mặt nạ tối đa {0} byte.
zh_hans: 掩码最多 {0} 字节。
zh_hant: 遮罩最多可為 {0} 個位元組。

# Find_Error_MaskAllZero
source: The mask is all zero, so nothing would be compared.
ar: القناع كله أصفار، لذا لن تتم مقارنة أي شيء.
cs: Maska obsahuje samé nuly, takže by se nic neporovnávalo.
de: Die Maske besteht nur aus Nullen, daher würde nichts verglichen.
el: Η μάσκα είναι όλη μηδενικά, επομένως δεν θα συγκρινόταν τίποτα.
es: La máscara es toda cero, así que no se compararía nada.
fa: ماسک تماماً صفر است، بنابراین چیزی مقایسه نمی‌شود.
fr: Le masque est entièrement à zéro ; rien ne serait comparé.
hu: A maszk csupa nulla, így semmi sem lenne összehasonlítva.
id: Mask semuanya nol, sehingga tidak ada yang dibandingkan.
it: La maschera è tutta a zero, quindi non verrebbe confrontato nulla.
ja: マスクがすべて 0 です。比べるビットがありません。
ko: 마스크가 모두 0이므로 비교할 비트가 없습니다.
pl: Maska składa się z samych zer, więc nic nie zostałoby porównane.
pt: A máscara é toda zero, então nada seria comparado.
ro: Masca este numai zerouri, așa că nu s-ar compara nimic.
th: มาสก์เป็นศูนย์ทั้งหมด จึงไม่มีสิ่งใดให้เปรียบเทียบ
tr: Maskenin tamamı sıfır olduğundan hiçbir şey karşılaştırılmaz.
uk: Маска складається з нулів, тому нічого не порівнюватиметься.
vi: Mặt nạ toàn số 0 nên không có gì để so sánh.
zh_hans: 掩码全部为零，因此不会比较任何内容。
zh_hant: 遮罩全部為零，因此不會比較任何內容。

# Find_Error_BitPatternLength
source: A bit pattern needs 8 characters per byte ({0} characters now).
ar: يحتاج نمط البتات إلى 8 أحرف لكل بايت ({0} حرفًا حاليًا).
cs: Bitový vzor potřebuje 8 znaků na bajt (nyní znaků: {0}).
de: Ein Bitmuster benötigt 8 Zeichen pro Byte (derzeit {0} Zeichen).
el: Ένα μοτίβο bit χρειάζεται 8 χαρακτήρες ανά byte (τώρα {0} χαρακτήρες).
es: Un patrón de bits necesita 8 caracteres por byte (ahora hay {0}).
fa: الگوی بیتی برای هر بایت 8 نویسه لازم دارد (اکنون {0} نویسه).
fr: Un motif de bits nécessite 8 caractères par octet ({0} caractères actuellement).
hu: A bitmintához bájtonként 8 karakter szükséges (jelenleg {0} karakter).
id: Pola bit memerlukan 8 karakter per byte (sekarang {0} karakter).
it: Un modello di bit richiede 8 caratteri per byte (ora {0} caratteri).
ja: ビットパターンは 8 文字で 1 バイトです (今は {0} 文字)。
ko: 비트 패턴은 바이트당 8문자가 필요합니다(현재 {0}문자).
pl: Wzorzec bitowy wymaga 8 znaków na bajt (obecnie znaki: {0}).
pt: Um padrão de bits precisa de 8 caracteres por byte ({0} caracteres agora).
ro: Un model de biți necesită 8 caractere pe octet (acum {0} caractere).
th: รูปแบบบิตต้องมี 8 อักขระต่อไบต์ (ขณะนี้ {0} อักขระ)
tr: Bit deseni bayt başına 8 karakter gerektirir (şu anda {0} karakter).
uk: Бітовому шаблону потрібно 8 символів на байт (зараз символів: {0}).
vi: Mẫu bit cần 8 ký tự cho mỗi byte (hiện có {0} ký tự).
zh_hans: 位模式每个字节需要 8 个字符（当前为 {0} 个字符）。
zh_hant: 位元模式每個位元組需要 8 個字元（目前為 {0} 個字元）。

# Find_Error_InvalidBit
source: Only 0, 1 and x can be used in a bit pattern: {0}
ar: لا يمكن استخدام سوى 0 و1 وx في نمط البتات: {0}
cs: V bitovém vzoru lze použít jen 0, 1 a x: {0}
de: In einem Bitmuster sind nur 0, 1 und x zulässig: {0}
el: Σε μοτίβο bit μπορούν να χρησιμοποιηθούν μόνο τα 0, 1 και x: {0}
es: En un patrón de bits solo se pueden usar 0, 1 y x: {0}
fa: در الگوی بیتی فقط 0، 1 و x قابل استفاده است: {0}
fr: Seuls 0, 1 et x sont autorisés dans un motif de bits : {0}
hu: A bitmintában csak 0, 1 és x használható: {0}
id: Hanya 0, 1, dan x yang dapat digunakan dalam pola bit: {0}
it: In un modello di bit si possono usare solo 0, 1 e x: {0}
ja: ビットパターンに使えるのは 0、1、x だけです: {0}
ko: 비트 패턴에는 0, 1, x만 사용할 수 있습니다: {0}
pl: We wzorcu bitowym można używać tylko 0, 1 i x: {0}
pt: Somente 0, 1 e x podem ser usados em um padrão de bits: {0}
ro: Într-un model de biți pot fi utilizate doar 0, 1 și x: {0}
th: ใช้ได้เฉพาะ 0, 1 และ x ในรูปแบบบิต: {0}
tr: Bit deseninde yalnızca 0, 1 ve x kullanılabilir: {0}
uk: У бітовому шаблоні можна використовувати лише 0, 1 і x: {0}
vi: Chỉ dùng được 0, 1 và x trong mẫu bit: {0}
zh_hans: 位模式中只能使用 0、1 和 x：{0}
zh_hant: 位元模式中只能使用 0、1 和 x：{0}

# Find_Error_RangeOrder
source: The minimum ({0}) is larger than the maximum ({1}).
ar: الحد الأدنى ({0}) أكبر من الحد الأقصى ({1}).
cs: Minimum ({0}) je větší než maximum ({1}).
de: Das Minimum ({0}) ist größer als das Maximum ({1}).
el: Το ελάχιστο ({0}) είναι μεγαλύτερο από το μέγιστο ({1}).
es: El mínimo ({0}) es mayor que el máximo ({1}).
fa: حداقل ({0}) از حداکثر ({1}) بزرگ‌تر است.
fr: Le minimum ({0}) est supérieur au maximum ({1}).
hu: A minimum ({0}) nagyobb a maximumnál ({1}).
id: Nilai minimum ({0}) lebih besar dari maksimum ({1}).
it: Il minimo ({0}) è maggiore del massimo ({1}).
ja: 最小 ({0}) が最大 ({1}) より大きくなっています。
ko: 최솟값({0})이 최댓값({1})보다 큽니다.
pl: Minimum ({0}) jest większe niż maksimum ({1}).
pt: O mínimo ({0}) é maior que o máximo ({1}).
ro: Minimul ({0}) este mai mare decât maximul ({1}).
th: ค่าต่ำสุด ({0}) มากกว่าค่าสูงสุด ({1})
tr: En küçük değer ({0}) en büyük değerden ({1}) büyük.
uk: Мінімум ({0}) більший за максимум ({1}).
vi: Giá trị nhỏ nhất ({0}) lớn hơn giá trị lớn nhất ({1}).
zh_hans: 最小值（{0}）大于最大值（{1}）。
zh_hant: 最小值（{0}）大於最大值（{1}）。

# Find_Error_RegexSyntax
source: Regular expression error: {0}
ar: خطأ في التعبير العادي: {0}
cs: Chyba regulárního výrazu: {0}
de: Fehler im regulären Ausdruck: {0}
el: Σφάλμα κανονικής έκφρασης: {0}
es: Error en la expresión regular: {0}
fa: خطای عبارت باقاعده: {0}
fr: Erreur d'expression régulière : {0}
hu: Reguláriskifejezés-hiba: {0}
id: Kesalahan ekspresi reguler: {0}
it: Errore nell'espressione regolare: {0}
ja: 正規表現の誤り: {0}
ko: 정규식 오류: {0}
pl: Błąd wyrażenia regularnego: {0}
pt: Erro na expressão regular: {0}
ro: Eroare în expresia regulată: {0}
th: ข้อผิดพลาดของนิพจน์ทั่วไป: {0}
tr: Normal ifade hatası: {0}
uk: Помилка регулярного виразу: {0}
vi: Lỗi biểu thức chính quy: {0}
zh_hans: 正则表达式错误：{0}
zh_hant: 規則運算式錯誤：{0}

# Find_Error_RegexUnicodeProperty
source: Unicode properties can't be used in a byte regular expression.
ar: لا يمكن استخدام خصائص Unicode في تعبير عادي للبايتات.
cs: V bajtovém regulárním výrazu nelze použít vlastnosti Unicode.
de: Unicode-Eigenschaften können in einem regulären Byte-Ausdruck nicht verwendet werden.
el: Οι ιδιότητες Unicode δεν μπορούν να χρησιμοποιηθούν σε κανονική έκφραση byte.
es: No se pueden usar propiedades Unicode en una expresión regular de bytes.
fa: ویژگی‌های Unicode در عبارت باقاعدهٔ بایتی قابل استفاده نیستند.
fr: Les propriétés Unicode ne peuvent pas être utilisées dans une expression régulière d'octets.
hu: Bájtos reguláris kifejezésben Unicode-tulajdonságok nem használhatók.
id: Properti Unicode tidak dapat digunakan dalam ekspresi reguler byte.
it: Le proprietà Unicode non possono essere usate in un'espressione regolare di byte.
ja: バイト列の正規表現では Unicode プロパティは使えません。
ko: 바이트 정규식에서는 Unicode 속성을 사용할 수 없습니다.
pl: Właściwości Unicode nie mogą być używane w bajtowym wyrażeniu regularnym.
pt: Propriedades Unicode não podem ser usadas em uma expressão regular de bytes.
ro: Proprietățile Unicode nu pot fi utilizate într-o expresie regulată pe octeți.
th: ไม่สามารถใช้คุณสมบัติ Unicode ในนิพจน์ทั่วไปแบบไบต์
tr: Bayt normal ifadesinde Unicode özellikleri kullanılamaz.
uk: У байтовому регулярному виразі не можна використовувати властивості Unicode.
vi: Không thể dùng thuộc tính Unicode trong biểu thức chính quy byte.
zh_hans: 字节正则表达式中不能使用 Unicode 属性。
zh_hant: 位元組規則運算式中不能使用 Unicode 屬性。
